
#+begin_src emacs-lisp :tangle org-cthulhu.el
(require 'cl-lib)
(require 'dash)
(require 'org-ml)
#+end_src

#+RESULTS:
: org-ml

* Import des personnages 

#+begin_src emacs-lisp
(defun get-tagged-subtree (taglist)
  "Détermine la liste les enfants des nœuds dont la liste des tags est taglist "
  (apply #'-concat (-map #'org-ml-get-children 
  (org-ml-match '((:tags taglist)) (org-ml-parse-this-buffer)))))
#+end_src

#+RESULTS:
: get-tagged-subtree

#+begin_src emacs-lisp :tangle org-cthulhu.el
(defun get-characters-name ()
  (--map (org-ml-get-property :raw-value it) (get-tagged-subtree '("personnage"))))

(defun get-name (personnage)
  (org-ml-get-property :raw-value personnage))
#+end_src

#+RESULTS:
: get-name

#+begin_src emacs-lisp
;; (get-characters-name)
;; (get-name (select-character))
#+end_src

#+RESULTS:
| Bobby Watson : un fameux concierge | Ybbo Nostaw : cambrioleur | La goule |

* Ajout de sous-sections

#+begin_src emacs-lisp
(defvar default-sections
  '("Objets"
   "Personnages"
   "Monstres"
   "Lieux"
   "Événements"
   "Documentation"))

(defun get-document-sections ()
  (--map (org-ml-get-property :raw-value it) (org-ml-parse-subtrees 'all)))

(defun add-new-subsection (section subtitle content)
  (save-excursion
    (goto-char 0)
    (re-search-forward (s-lex-format "^* ${section}"))
    (org-insert-subheading (point))
    (insert subtitle)
    (org-newline-and-indent)
    (insert content)
    (org-id-get-create)))

#+end_src

#+RESULTS:
: add-new-subsection


#+begin_src emacs-lisp
(defun cthulhu-new-thing-and-make-link (type)
  (interactive "P")
  (let* ((type (if (not type) (completing-read "Sélection ?" (get-document-sections))
		 type))
	 (thing (read-from-minibuffer (s-lex-format "${type} à ajouter ?")))
	 (desc (read-from-minibuffer "Description"))
	 (id (add-new-subsection type thing desc)))
    (org-insert-link nil (concat "id:" id) thing)))

(defun make-adders (default-sections)
  (--map (let* ((type it)
                (fun-name (concat "cthulhu-new-" type "-and-make-link")))
           (defalias (intern fun-name) `(lambda () (interactive) (cthulhu-new-thing-and-make-link ,type))))
         default-sections))

(make-adders default-sections)
#+end_src

#+RESULTS:
| cthulhu-new-Objets-and-make-link | cthulhu-new-Personnages-and-make-link | cthulhu-new-Monstres-and-make-link | cthulhu-new-Lieux-and-make-link | cthulhu-new-Événements-and-make-link | cthulhu-new-Documentation-and-make-link |

** Récupérer la section de ses tables 

#+begin_src emacs-lisp :tangle org-cthulhu.el 
(defun select-character ()
  "Renvoie _un_ personnage du buffer courant"
  (let* ((personnages-liste (get-tagged-subtree '("personnage")))
         (personnage-selectionné (completing-read "Sélectionner un personnage: " (get-characters-name) nil t)))
    (car (--filter (string= (org-ml-get-property :raw-value it) personnage-selectionné) personnages-liste))))

;; On peut probablement utiliser org-ml-match...
(defun get-tables (personnage)
  "Récupère la section des tables d'un personnage donné"
  (car (--filter (string= (org-ml-get-property :raw-value it) "Tables") (org-ml-get-children personnage))))

(get-tables (select-character))
#+end_src

#+RESULTS:
| headline | (:raw-value Tables :begin 20478 :end 23200 :pre-blank 0 :contents-begin 20489 :contents-end 23200 :level 3 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 20478 :title (Tables) :parent (headline (:raw-value La goule :begin 20038 :end 23200 :pre-blank 0 :contents-begin 20050 :contents-end 23200 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 20038 :title (La goule) :parent (headline (:raw-value Monstres tests :begin 19960 :end 23202 :pre-blank 0 :contents-begin 20038 :contents-end 23200 :level 1 :priority nil :tags (personnage) :todo-keyword nil :todo-type nil :post-blank 2 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 19960 :title (Monstres tests) :parent (org-data nil (section (:begin 2 :end 132 :contents-begin 2 :contents-end 131 :post-blank 1 :post-affiliated 2 :parent #5) (src-block (:language emacs-lisp :switches nil :parameters :tangle org-cthulhu.el :begin 2 :end 111 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value (require 'cl-lib) |

# #+begin_src emacs-lisp
# ;; Récupérer les tables du personnage sélectionné dans la liste. Oh tiens : =)
# (org-ml-get-property :begin (car (get-tables (select-character personnages-subtrees))))
# (org-ml-get-property :end (car (get-tables (select-character personnages-subtrees))))
# #+end_src

# #+RESULTS:
# : 14299

** Tests de caractéristique


#+begin_src emacs-lisp :tangle org-cthulhu.el
(defun roll100 (&optional modif)
  "Lance un dé 100 avec des dés bonus/malus "
  (if (not modif)
      (random 100)
  (let* ((choose-dice-fun (if (< 0 modif) #'min #'max))
         (dizaines-chiffre (apply choose-dice-fun
                                  (loop for i below (1+ (abs modif))
                                        collect (random 10))))
         (unités-chiffre (random 10)))
    (+ unités-chiffre (* dizaines-chiffre 10))))))
    ;; (format "%d%d" dizaines-chiffre unités-chiffre)))

(defun roll (Ds F &optional modif)
  "Renvoie une liste de lancés de dés. "
  (if (= F 100)
      (loop for i below Ds
	    collect (roll100 modif))
    (loop for i below Ds
	  collect (1+ (random F)))))
#+end_src

#+RESULTS:
: roll100

#+begin_src emacs-lisp
(defun select-roll-character-carac (&optional modif)
  (interactive)
  (let* ((perso (select-character))
         (carac (select-get-carac perso))
         (roll (roll100 modif))
         (out (roll-success roll carac)))
    (message (format "%d [%d, %d, %d] : %s" roll carac (majeur carac) (extreme carac) (get-success out)))))

;; (select-roll-character-carac)
#+end_src

#+RESULTS:
: 57 [90, 45, 18] : Réussite normale

**** Caractéristiques 

#+TBLNAME: carac
| FOR | 90 | 25 | 10 |
| CON | 60 | 30 | 12 |
| TAI | 70 | 25 | 10 |
| DEX | 70 | 35 | 14 |
| INT | 50 | 25 | 10 |
| APP | 50 | 25 | 10 |
| POU | 80 | 30 | 12 |
| EDU | 10 |  5 |  2 |
| AGE | 35 |    |    |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

**** Santé physique et psychique

| Santé mentale   | 80 | 40 | 16 |
| Points de vie   | 13 |    |    |
| Points de magie | 16 |    |    |
| Chance          |    |  0 |  0 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

**** Caractéristiques de combat

| Corps à corps (1D3)          |  25 | 13 | 5 |
| -- Carrure                   |   1 |    |   |
| -- Impact                    | 1D4 |    |   |
| Armes à feu (armes de poing) |  20 | 10 | 4 |
| Armes à feu (fusils)         |  25 | 13 | 5 |
| Armes à feu (mitraillettes)  |  15 |  8 | 3 |
| -- Esquive                   |  35 | 17 | 7 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Sociales

| Baratin      |  5 | 3 | 1 |
| Charme       | 15 | 8 | 3 |
| Intimidation | 15 | 8 | 3 |
| Persuasion   | 10 | 5 | 2 |
| Psychologie  | 10 | 5 | 2 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Se repérer

| Bibliothèque        | 20 | 10 | 4 |
| Orientation         | 10 |  5 | 2 |
| Pister              | 10 |  5 | 2 |
| Trouver objet caché | 25 | 13 | 5 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Soins

| Premier soins | 30 | 15 | 6 |
| Médecine      |  1 |  1 | 0 |
| Psychanalyse  |  1 |  1 | 0 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Se déplacer

| Conduite   | 20 | 10 | 4 |
| Grimper    | 20 | 10 | 4 |
| Lancer     | 20 | 10 | 4 |
| Nager      | 20 | 10 | 4 |
| Pilotage   |  1 |  1 | 0 |
| Sauter     | 20 | 10 | 4 |
| Survie     | 10 |  5 | 2 |
| Écouter    | 20 | 10 | 4 |
| Équitation |  5 |  3 | 1 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Filouterie

| Discrétion | 20 | 10 | 4 |
| Imposture  |  5 |  3 | 1 |
| Crochetage |  1 |  1 | 0 |
| Pickpocket | 10 |  5 | 2 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Connaissances théoriques

| Anthropologie     |   1 |              1 |              0 |
| Archéologie       |   1 |              1 |              0 |
| Arts et métiers   |     |              0 |              0 |
| Droit | 555 | 277 | 111 |
| Histoire          |   5 |              3 |              1 |
| Langue maternelle | EDU | round(EDU / 2) | round(EDU / 5) |
| Langues (autre)   |   1 |              1 |              0 |
| Naturalisme       |  10 |              5 |              2 |
| Sciences          |   1 |              1 |              0 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Argent 

| Comptabilité | 5 | 3 | 1 |
| Crédit       | 0 | 0 | 0 |
| Estimation   | 5 | 3 | 1 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

